In [1]:
# conda install -c conda-forge ipython-sql
%load_ext sql

In [2]:
# %sql postgresql://student:student@127.0.0.1/sparkifydb
%sql postgresql://hynso:sigeMund67@127.0.0.1/sparkifydb

'Connected: hynso@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://hynso:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 18, 2, 33, 21, 796000), 83, 'free', None, None, 693, 'Lubbock, TX', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (2, datetime.datetime(2018, 11, 18, 3, 22, 4, 796000), 40, 'free', None, None, 555, 'Oxnard-Thousand Oaks-Ventura, CA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"'),
 (3, datetime.datetime(2018, 11, 18, 9, 39, 4, 796000), 40, 'free', None, None, 698, 'Oxnard-Thousand Oaks-Ventura, CA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"'),
 (4, datetime.datetime(2018, 11, 18, 10, 18, 11, 796000), 79, 'free', None, None, 78, 'Dallas-Fort Worth-Arlington, TX', 'Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; Trident/5.0)'),
 (5, datetime.datetime(2018, 11, 18, 13, 16, 1, 796000), 29, 'paid', None, None, 589, 'Atlanta-Sandy Springs-Roswell, GA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://hynso:***@127.0.0.1/sparkifydb
5 rows affected.

[(83, 'Stefany', 'White', 'F', 'free'),
 (40, 'Tucker', 'Garrison', 'M', 'free'),
 (79, 'James', 'Martin', 'M', 'free'),
 (29, 'Jacqueline', 'Lynch', 'F', 'paid'),
 (35, 'Molly', 'Taylor', 'F', 'free')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://hynso:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOIAZJW12AB01853F1', 'Pink World', 'AR8ZCNI1187B9A069B', 1984, Decimal('269.81832')),
 ('SOXVLOJ12AB0189215', 'Amor De Cabaret', 'ARKRRTF1187B9984DA', 0, Decimal('177.47546')),
 ('SOUDSGM12AC9618304', 'Insatiable (Instrumental Version)', 'ARNTLGG11E2835DDB9', 0, Decimal('266.39628')),
 ('SOMJBYD12A6D4F8557', 'Keepin It Real (Skit)', 'ARD0S291187B9B7BF5', 0, Decimal('114.78159')),
 ('SOQHXMF12AB0182363', 'Young Boy Blues', 'ARGSJW91187B9B1D6B', 0, Decimal('218.77506'))]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://hynso:***@127.0.0.1/sparkifydb
5 rows affected.

[('AR8ZCNI1187B9A069B', 'Planet P Project', '', Decimal('NaN'), Decimal('NaN')),
 ('ARKRRTF1187B9984DA', 'Sonora Santanera', '', Decimal('NaN'), Decimal('NaN')),
 ('ARNTLGG11E2835DDB9', 'Clp', '', Decimal('NaN'), Decimal('NaN')),
 ('ARD0S291187B9B7BF5', 'Rated R', 'Ohio', Decimal('NaN'), Decimal('NaN')),
 ('ARGSJW91187B9B1D6B', 'JennyAnyKind', 'North Carolina', Decimal('35.21962'), Decimal('-80.01955'))]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://hynso:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 18, 2, 33, 21, 796000), 2, 18, 46, 11, 2018, 6),
 (datetime.datetime(2018, 11, 18, 3, 22, 4, 796000), 3, 18, 46, 11, 2018, 6),
 (datetime.datetime(2018, 11, 18, 9, 39, 4, 796000), 9, 18, 46, 11, 2018, 6),
 (datetime.datetime(2018, 11, 18, 10, 18, 11, 796000), 10, 18, 46, 11, 2018, 6),
 (datetime.datetime(2018, 11, 18, 13, 16, 1, 796000), 13, 18, 46, 11, 2018, 6)]

In [8]:
%sql \
SELECT \
  song_id, \
  artists.artist_id \
FROM songs \
JOIN artists \
ON songs.artist_id = artists.artist_id \
WHERE \
  songs.title = 'Pink World' AND \
  artists.name = 'Planet P Project' AND \
  songs.duration = 269.81832;

 * postgresql://hynso:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOIAZJW12AB01853F1', 'AR8ZCNI1187B9A069B')]

In [10]:
%sql \
SELECT \
  song_id, \
  artists.artist_id \
FROM songs \
JOIN artists \
ON songs.artist_id = artists.artist_id \
WHERE \
  songs.title = 'Amor De Cabaret' AND \
  artists.name = 'Sonora Santanera' AND \
  songs.duration = 177.47546;

 * postgresql://hynso:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOXVLOJ12AB0189215', 'ARKRRTF1187B9984DA')]

In [11]:
%sql SELECT song_id, COUNT(*) FROM songplays GROUP BY song_id;

 * postgresql://hynso:***@127.0.0.1/sparkifydb
0 rows affected.

[]